Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationPartFitFailure Property
 Fabrication Part Fitting Failed to Fit
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationPartFitFailure { get; }
Public Shared ReadOnly Property FabricationPartFitFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationPartFitFailure {
	FailureDefinitionId^ get ();
}
static member FabricationPartFitFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace